task/single-software/cli/openfoam/task-08/init_file/airfoil_base/constant/turbulenceProperties
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object      turbulenceProperties;
}
simulationType RAS;
RAS
{
    model SpalartAllmaras; // TODO_TURB_MODEL
    turbulence on;
    printCoeffs on;
}
